[
    {
        "name": "The Five Pillars of Islam",
        "ingredients": [
            {
                "title": "Shahada (Faith)",
                "description": "Understand the declaration of faith in Islam and its significance."
            },
            {
                "title": "Salat (Prayer)",
                "description": "Explore the importance of daily prayers and their method of performance."
            },
            {
                "title": "Zakat (Charity)",
                "description": "Learn about the obligation of giving to charity in Islam and its purposes."
            },
            {
                "title": "Sawm (Fasting)",
                "description": "Discover the significance of fasting during the month of Ramadan."
            },
            {
                "title": "Hajj (Pilgrimage)",
                "description": "Explore the pilgrimage to Mecca and its rituals."
            }
        ],
        "method": "1. In a large bowl, mix together the lamb mince, onion, cumin, sumac, red pepper flakes, salt, and black pepper.2. Divide the mixture into 8 portions and shape each into a long sausage shape around a skewer.3. Grill the kebabs over medium-high heat for 5-6 minutes on each side, or until cooked through.",
        "rating": 4.5
    },
    {
        "name": "Quranic Studies",
        "ingredients": [
            {
                "title": "Structure of the Quran",
                "description": "Learn about the organization and chapters (Surahs) of the Quran."
            },
            {
                "title": "Tafsir (Interpretation)",
                "description": "Understand the scholarly interpretation of Quranic verses (Ayahs)."
            },
            {
                "title": "Significance of Surahs",
                "description": "Explore the meanings and themes of specific chapters in the Quran."
            }
        ],
        "method": "1. Rinse the lentils and place them in a pot with the water. Bring to a boil, then reduce the heat and simmer for 20 minutes, or until the lentils are soft and the water is absorbed.2. Mix together the cooked lentils, bulgur, onion, olive oil, lemon juice, tomato paste, salt, cumin, black pepper.",
        "rating": 4.2
    },
    {
        "name": "Hadith and Sunnah",
        "ingredients": [
            {
                "title": "Importance of Hadith",
                "description": "Understand the role of Hadith in Islamic jurisprudence."
            },
            {
                "title": "Hadith Terminology",
                "description": "Learn key terms used in Hadith scholarship."
            },
            {
                "title": "Following the Sunnah",
                "description": "Explore the significance of following the Prophet's teachings."
            }
        ],
        "method": "1. Preheat the oven to 350°F (175°C).2. Mix together the walnuts and sugar in a bowl.3. Grease a baking dish with some of the melted butter.4. Lay a sheet of phyllo dough in the bottom of the baking dish, then brush with melted butter. Repeat with 5 more sheets of phyllo dough, brushing each with butter.",
        "rating": 4.8
    }
]